app/Http/Controllers/ListingController.php

select count(*) as aggregate from `listings`
---
    public function index()
    {
        return view(
            'listings.home',
            [
                'heading' => 'Latest Listings',
                'listings' => Cache::remember(
                    'listings',
                    now()->addSeconds(30),
                    function () {
                        return Listing::latest()
                            ->published()
                            ->filter(request(['tag', 'search']))
                            ->paginate(50);
                    }
                )